{"pages":[{"title":"关于我","text":"我是谁? Σ(っ °Д °;)っ我在哪？Σ(ﾟДﾟ；≡；ﾟдﾟ)我在做什么？┬─┬ ノ( ‘ - ‘ノ) ( ╯ ‵ □ ′ )╯︵┻━┻","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/04/30/hello-world/"},{"title":"左撇子人生（一）","text":"回顾一下我的人生，并没有什么特别值得回味的事情。 今天是2019年5月6日，立夏，晴天但感觉不到什么温暖，尽管有太阳，冷风却依旧往衣领里灌。一整天我都坐在办公室里戴着耳机听着一些小众音乐冷漠的敲着毫无意义的代码，同事们也都在认真工作或讨论着一些业务方面的事情，因为我在一家医院外包公司工作，所以在这间 信息外包办公室 里还有其他公司的外包人员，人多嘴杂避免不了有些吵闹，唯一清净的时候就只有早晨和中午了。 从年初上班开始，基本上就是在维护去年开发的项目。出现一些新需求或者需要修复的BUG就会忙一下，弄完就基本就没什么事了。差不多是做一天休一天的状态，我会在没有需求的时候做自己的项目用来提升自己的技能。 这张开发路线图是我目前正在学习的路线图，尽量让自己不走弯路的学习提升技能。从2015年底开始工作到现在已经好多年了，但刚毕业的时候我想走的技术路线是Java，但无奈第一家公司只有算老板只有二十个人还赶上他们正在做项目，而我是个新人领导并没有让我也接手项目，所以自己前期只是在“混日子”。学校里面教的 Java/C#/JavaScript/CSS/HTML/Oracle/SQLServer 这些技能我都会，同学都说我是班级的学霸。但我自己却觉得我技术一般，现在想来也还是很一般。后来领导问我会不会.NET，然后我就被调到 .NET组 开发内部即时通讯系统，当时的技术还是 WCF + WPF，这大概是我跟.NET的缘分了。 后来我也因为一些原因离职了，2016年来到上海工作，这家公司一共只有不到十个人，而我是整个公司的第一个技术人员，他们此前的项目是从合作公司买来的，我来了之后就直接上手做项目，所以我的职业生涯从一开始就没有人带过我，这也造就了我在第二家公司的败笔。当时的项目是很古老的ASP.NET 拖拽控件的形式开发Web项目，学校里仅教过ASP.NET MVC，我就只好自学,每天在挨骂中度日，后来，我通过自学的Java SSM框架(即：Spring|SpringMVC|MyBatis，当时最流行的框架，那时候还没有SpringBoot等框架的出现)，做了好多项目(当然只有我自己一个人，所以并不知道自己的水平，只是觉得自己很垃圾)，在年底的时候又过来了一套框架，依旧是ASP.NET但不同的是，前端框架是Bootstrap，采用 Ajax + ashx 的方式进行请求数据。然后开始了每天都是很无聊的增删改查，自己曾因为赶这个项目，几个月无休息的从早晨六点钟干到凌晨两三点钟下班，自己的生日和圣诞节都是在加班中度过。 不知道什么时候开始我的编程生涯开窍了，觉得好多技术即使自己没见过没用过看看项目源码就懂得怎么写了，第二年开始招人，实施、.NET开发工程师、前台。其中.NET人员由我来面试我来带团队，我没过带过人的经验，而招的人都是实习生，领导说想培养一些可以走到公司最后的人，实际上只是想省一些钱，我带领团队之后我的败笔就来了，我变得越来越疲惫，他们不会还不学习，领导规定他们要做完的日期到了，他们做不完还得我给他们做，到头来整个项目还是我一个人做的，而他们的工资几乎都是我给他们拿的，就这样带了一年，他们依旧不会熟练地掌握这套框架，最终年底的时候带的新人走了一个不剩的，原因就是领导经常骂他们，第三年我也准备离职了，让他们招三年工作经验以上的人，每次谈这件事他们都回避不想谈(毕竟像我这样勤劳不辞辛苦还价格公道的人不好找)总是画大饼和劝我走了就找不到好的公司了，说我技术太垃圾了再多“呆”几年再走就好找工作了，而我已经下定决定了决心~找到一家以技术为核心的公司。毕竟自己的知识储备还很欠缺，前方的道路也依旧很遥远。 其实有一件事情我并不想谈，就是职场和生活。我一直都在小公司工作，而小公司的工作氛围不压抑很适合我，但这第二家公司我还是职场新人自以为和领导同事老板的关系都算是蛮好的，而他们也都很关心我的样子。但我离职的时候，我突然把所有的事情都相通了，通过打听后发现我带的人和我工资是一样的，而我这几年都没有涨过工资，勉强刚过上海薪资最低标准，而五险一金社保什么的骗我说帮我办了意思是还要我感激他们，但我走了才知道什么都没有办就连劳动合同都是快走的时候签的。所以的关心都是虚假的，所有的好话都是骗人的，领导当着我的面骂其他的新人，我就知道，我走了之后他们依旧会把骂其他人的话附加到我的身上说给其他人听。所以不必委屈自己，做好自己问心无愧。 达克效应（英语：D-K effect），全称为邓宁-克鲁格效应（英语：Dunning–Kruger effect），是一种认知偏差，能力欠缺的人有一种虚幻的自我优越感，错误地认为自己比真实情况更加优秀。简言之即：庸人容易因欠缺自知之明而自我膨胀。Kruger和Dunning将其归咎于元认知上的缺陷，能力欠缺的人无法认识到自身的无能，不能准确评估自身的能力。他们的研究还表明，反之，非常能干的人会低估自己的能力，错误地假定他们自己能够很容易完成的任务，别人也能够很容易地完成。 我曾一度非常自卑，我从学习到工作到现在，总是听到别人说我很厉害，但我并不知道自己厉害在哪里，一直觉得他们是外行都是在高估我，只有自己才知道自己的水平是什么样的。学的越多越觉得自己学的太少了，在第二家工作的几年时间里我的工资低没有攒下钱，没有攒下技术只是增删改查更加熟练。而公司又总是打击我，让我觉得自己太太太太太太垃圾。而自己懦弱内向的性格，无处发泄，造成了无意识的暴脾气很讨厌自己，跟家里人平时打电话聊天的时候，也会对他们发泄。我就是那种窝里横的人，对别人毕恭毕敬的，把所有的不满发泄给最亲近的人。 随着时间增长，我看开了许多事情，我依旧独来独往，但我并不孤独。我并不会看其他人对我什么看法什么评价那是他们的事与我无关，我只想做好自己。 希望自己现在的努力换来的是不让未来的我，讨厌现在的自己。","link":"/2019/05/06/left-hander-1/"},{"title":"网站推荐","text":"图片网站 Pexels Plixs Pixabay Picjumbo Pixeden Unsplash Barnimages Gratisography Chamberofcommerce Stocksnap Streetwill Stokpic Thenounproject","link":"/2019/05/08/website-recommended/"},{"title":".NET 5","text":"看到了最近微软官方的 .NET Blog 中写的一篇博文， 讲述的是 .NET Core 3.0 之后的下一个版本 .NET 5，不禁让我感到技术发展的迅猛。 官方原文","link":"/2019/05/07/dotnet-net5/"}],"tags":[{"name":"左撇子人生","slug":"左撇子人生","link":"/tags/左撇子人生/"},{"name":"网站推荐","slug":"网站推荐","link":"/tags/网站推荐/"},{"name":".NET","slug":"NET","link":"/tags/NET/"}],"categories":[{"name":"人生回顾","slug":"人生回顾","link":"/categories/人生回顾/"},{"name":"收藏","slug":"收藏","link":"/categories/收藏/"},{"name":".NET","slug":"NET","link":"/categories/NET/"}]}